# MultistoryStandardStairBottomEndExceedsOrNotReach Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..MultistoryStandardStairBottomEndExceedsOrNotReach Property
BuiltInFailures..::..StairRampFailures Class See Also
---
One of the stairs inside multistory stairs bottom ends exceeds or cannot reach the base elevation of the stair.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MultistoryStandardStairBottomEndExceedsOrNotReach { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MultistoryStandardStairBottomEndExceedsOrNotReach As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MultistoryStandardStairBottomEndExceedsOrNotReach {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace